Revit 2027 API
FamilyInstance.CanFlipFacing Property
Property to test whether the orientation of family instance facing can be flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFlipFacing { get; }
Public ReadOnly Property CanFlipFacing As Boolean
	Get
public:
property bool CanFlipFacing {
	bool get ();
}
member CanFlipFacing : bool with get
Property Value
Boolean
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace